Revit 2024 API
ElementStructuralTypeFilter Properties
The ElementStructuralTypeFilter type exposes the following members.
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
StructuralType
 The structural type.
See Also
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace